#+TITLE: Topic Notes
#+STARTUP: showeverything

|-----+------------------------|
| ID  | Feature                |
|-----+------------------------|
| [[F10]] | Listing Topics         |
| [[F15]] | Deleting Topics        |
| [[F20]] | Consuming from a Topic |

* Level 1
** TODO
** START
** HOLD
** DONE
CLOSED: [2020-09-19 Sat 20:35]
** CANCELLED
CLOSED: [2020-09-19 Sat 20:35]
** Level 2
*** Level 3
**** Level 4
***** Level 5
****** Level 6
******* Level 7
******** Level 8

* F10

* F15

* F20
** Messages piped to
- A built-in view where the user can show N Messages at a time
- Arbitrary UNIX tools like jq, less, etc.
- Clojure code
- JS code
** Allow consumption by
- Message offset
- Timestamp of Message insertion
* F25

#+BEGIN_SRC clojure
(str "Hello, world" "!!!")


#+END_SRC

#+RESULTS:
: Hello, world!!!
